<a href="https://colab.research.google.com/github/zova137/zova/blob/master/Cahpter3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# Load library 
import pandas as pd 
# Create URL 
url = 'https://tinyurl.com/titanic-csv' 
# Load data as a dataframe 
dataframe = pd.read_csv(url) 
# Show first 5 rows 
dataframe.head(5)

                                            Name PClass  ...  Survived SexCode
0                   Allen, Miss Elisabeth Walton    1st  ...         1       1
1                    Allison, Miss Helen Loraine    1st  ...         0       1
2            Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1
4                  Allison, Master Hudson Trevor    1st  ...         1       0

[5 rows x 6 columns]

In [7]:
# Create DataFrame 
dataframe = pd.DataFrame() 
# Add columns 
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson'] 
dataframe['Age'] = [38, 25] 
dataframe['Driver'] = [True, False] 
# Show DataFrame 
dataframe 
# Create row 
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver']) 
# Append row
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [9]:
# Show 2 rows
dataframe.head(2) 
# Show dimensions 
dataframe.shape  
# Show statistics 
dataframe.describe()

             Age
count   2.000000
mean   31.500000
std     9.192388
min    25.000000
25%    28.250000
50%    31.500000
75%    34.750000
max    38.000000

In [11]:
# Create URL 
url = 'https://tinyurl.com/titanic-csv' 
# Load data as a dataframe 
dataframe = pd.read_csv(url) 
# Select first row 
dataframe.iloc[0] 
# Select three rows(2nd,3rd,4th rows) 
dataframe.iloc[1:4] 
# Select rows up to 4 (1st, 2nd, 3rd, 4th rows) 
dataframe.iloc[:4] 
# Set index 
dataframe = dataframe.set_index(dataframe['Name']) 
# Show row 
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [12]:
# Show top two rows where column 'sex' is 'female' 
dataframe[dataframe['Sex'] == 'female'].head(2) 
# Filter rows 
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

                                                                                                 Name  ... SexCode
Name                                                                                                   ...
Crosby, Mrs Edward Gifford (Catherine Elizabeth...  Crosby, Mrs Edward Gifford (Catherine Elizabet...  ...       1

[1 rows x 6 columns]

In [13]:
# Replace values, show two rows 
dataframe['Sex'].replace("female", "Woman").head(2) 
# Replace "female" and "male with "Woman" and "Man" 
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5) 
# Replace values 
dataframe.replace(1, "One") 
# Replace values 
dataframe.replace("1st", "First", regex=True)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0
...                                                                                      ...  ...     ...
Zakarian, Mr Artun                                                        Zakarian, Mr Artun  ...       0
Zakarian, Mr Maprieder                                                Zakarian, Mr Maprieder  ...       0
Zenni, Mr Philip                                                            Zenni, Mr Philip  ...       0
Lievens, Mr Rene                                                            Lievens, Mr Rene  ...       0
Zimmerman, Leo                                                                Zimmerman, Leo  ...       0

[1313 rows x 6 columns]

In [14]:
# Rename column, show two rows 
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2) 
# Rename columns 
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'})

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0
...                                                                                      ...  ...     ...
Zakarian, Mr Artun                                                        Zakarian, Mr Artun  ...       0
Zakarian, Mr Maprieder                                                Zakarian, Mr Maprieder  ...       0
Zenni, Mr Philip                                                            Zenni, Mr Philip  ...       0
Lievens, Mr Rene                                                            Lievens, Mr Rene  ...       0
Zimmerman, Leo                                                                Zimmerman, Leo  ...       0

[1313 rows x 6 columns]

In [15]:
# Calculate statistics 
print('Maximum:', dataframe['Age'].max()) 
print('Minimum:', dataframe['Age'].min()) 
print('Mean:', dataframe['Age'].mean()) 
print('Sum:', dataframe['Age'].sum()) 
print('Count:', dataframe['Age'].count()) 
# Show counts 
dataframe.count()

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989415
Sum: 22980.88
Count: 756

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [16]:
# Select unique values 
dataframe['Sex'].unique() 
# Show counts 
dataframe['Sex'].value_counts() 
# Show counts 
dataframe['PClass'].value_counts() 
# Show number of unique values 
dataframe['PClass'].nunique()

4

In [18]:
# Select missing values, show two rows 
dataframe[dataframe['Age'].isnull()].head(2) 
# Attempt to replace values with NaN 
dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: ignored

In [21]:
# Load library 
import numpy as np 
# Replace values with NaN 
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan) 
# Load data, set missing values 
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [22]:
# Delete column 
dataframe.drop('Age', axis=1).head(2) 
# Drop columns 
dataframe.drop(['Age', 'Sex'], axis=1) 
# Drop column 
dataframe.drop(dataframe.columns[1], axis=1)

                                               Name    Age  ... Survived  SexCode
0                      Allen, Miss Elisabeth Walton  29.00  ...        1        1
1                       Allison, Miss Helen Loraine   2.00  ...        0        1
2               Allison, Mr Hudson Joshua Creighton  30.00  ...        0        0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)  25.00  ...        0        1
4                     Allison, Master Hudson Trevor   0.92  ...        1        0
...                                             ...    ...  ...      ...      ...
1308                             Zakarian, Mr Artun  27.00  ...        0        0
1309                         Zakarian, Mr Maprieder  26.00  ...        0        0
1310                               Zenni, Mr Philip  22.00  ...        0        0
1311                               Lievens, Mr Rene  24.00  ...        0        0
1312                                 Zimmerman, Leo  29.00  ...        0        0

[1313 rows x 5 columns]

In [23]:
# Delete rows, show first two rows of output 
dataframe[dataframe['Sex'] != 'male'].head(2) 
# Delete row by matching a unique value 
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'] 
# Delete row by index 
dataframe[dataframe.index != 0]

                                               Name PClass  ...  Survived SexCode
1                       Allison, Miss Helen Loraine    1st  ...         0       1
2               Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1
4                     Allison, Master Hudson Trevor    1st  ...         1       0
5                                Anderson, Mr Harry    1st  ...         1       0
...                                             ...    ...  ...       ...     ...
1308                             Zakarian, Mr Artun    3rd  ...         0       0
1309                         Zakarian, Mr Maprieder    3rd  ...         0       0
1310                               Zenni, Mr Philip    3rd  ...         0       0
1311                               Lievens, Mr Rene    3rd  ...         0       0
1312                                 Zimmerman, Leo    3rd  ...         0       0

[1312 rows x 6 columns]

In [24]:
# Drop duplicates, show first two rows of output 
dataframe.drop_duplicates().head(2) 
# Drop duplicates 
dataframe.drop_duplicates(subset=['Sex']) 
# Drop duplicates 
dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [25]:
# Group rows 
dataframe.groupby('Sex') 
# Group rows by the values of the column 'Sex', calculate mean of each group 
dataframe.groupby('Sex').mean() 
# Group rows, count rows 
dataframe.groupby('Survived')['Name'].count() 
# Group rows, calculate mean 
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [26]:
# Create date range 
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S') 
# Create DataFrame 
dataframe = pd.DataFrame(index=time_index) 
# Create column of random values 
dataframe['Sale_Amount']=np.random.randint(1, 10, 100000) 
# Show three rows 
dataframe.head(3) 
# Group rows by week, calculate sum per week 
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        85734
2017-06-18       100871
2017-06-25       100171
2017-07-02       101029
2017-07-09       101261
2017-07-16        10391

In [27]:
# Group by two weeks, calculate mean 
dataframe.resample('2W').mean() 
# Group by month, count rows 
dataframe.resample('M').count() 
# Group by month, count rows, show left label 
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [29]:
# Create URL 
url = 'https://tinyurl.com/titanic-csv' 
# Load data as a dataframe 
dataframe = pd.read_csv(url) 
# Print first two names uppercased 
for name in dataframe['Name'][0:2]: 
  print(name.upper()) 
# Show first two names uppercased 
[name.upper() for name in dataframe['Name'][0:2]]

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [30]:
# Create function 
def uppercase(x): return x.upper() 
# Apply function, show two rows 
dataframe['Name'].apply(uppercase)[0:2] 
# Group rows, apply function to groups 
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [31]:
# Create DataFrame a & b 
data_a = {'id': ['1', '2', '3'], 'first': ['Alex', 'Amy', 'Allen'], 'last': ['Anderson', 'Ackerman', 'Ali']} 
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last']) 
data_b = {'id': ['4', '5', '6'], 'first': ['Billy', 'Brian', 'Bran'], 'last': ['Bonder', 'Black', 'Balwner']} 
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last']) 
# Concatenate DataFrames by rows 
pd.concat([dataframe_a, dataframe_b], axis=0) 
# Concatenate DataFrames by columns 
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [32]:
# Create DataFrame employee & sales 
employee_data = {'employee_id': ['1', '2', '3', '4'], 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']} 
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id', 'name']) 
sales_data = {'employee_id': ['3', '4', '5', '6'], 'total_sales': [23456, 2512, 2345, 1455]} 
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id', 'total_sales']) 
# Merge DataFrames 
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [33]:
# Merge DataFrames 
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer') 
# Merge DataFrames 
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left') 
# Merge DataFrames 
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512